FixingStreet+/app/controllers/condition_incidences_controller.rb

  def index
    @condition_incidences = ConditionIncidence.all
---
SELECT "condition_incidences".* FROM "condition_incidences"