FixingStreet+/app/controllers/home_controller.rb

SELECT "incidences".* FROM "incidences"
---
  def index
  	@incidences = Incidence.all