FixingStreet+/app/controllers/incidences_controller.rb

SELECT  "incidences".* FROM "incidences"  LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "incidences"
---
  def index
   @incidences = Incidence.all.paginate(page: params[:page], per_page: 2)

INSERT INTO "incidences" ("created_at", "description", "motive_id", "reference", "type_id", "ubigeo_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-07 17:27:33.122326"], ["description", ""], ["motive_id", 1], ["reference", ""], ["type_id", 1], ["ubigeo_id", 2], ["updated_at", "2014-10-07 17:27:33.122326"]]
---
  def create
    @incidence = Incidence.new(incidence_params)

    respond_to do |format|
      if @incidence.save

UPDATE "incidences" SET "description" = ?, "latitud" = ?, "longitud" = ?, "motive_id" = ?, "reference" = ?, "updated_at" = ? WHERE "incidences"."id" = 4  [["description", "prueba en maps"], ["latitud", -12.104585350924093], ["longitud", -76.96326606931154], ["motive_id", 2], ["reference", "sjjjsjs"], ["updated_at", "2014-10-07 19:28:13.219713"]]
---
  def update
    respond_to do |format|
      if @incidence.update(incidence_params)

DELETE FROM "incidences" WHERE "incidences"."id" = ?  [["id", 1]]
---
  def destroy
    @incidence.destroy

SELECT  "incidences".* FROM "incidences"  WHERE "incidences"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_incidence
      @incidence = Incidence.find(params[:id])