FixingStreet+/app/controllers/motives_controller.rb

  def index
    @motives = Motive.all
---
SELECT "motives".* FROM "motives"

  def create
    @motive = Motive.new(motive_params)

    respond_to do |format|
      if @motive.save
---
INSERT INTO "motives" ("created_at", "name", "status", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-07 17:12:12.543019"], ["name", "Semaforo mal sincronizado"], ["status", "t"], ["updated_at", "2014-10-07 17:12:12.543019"]]

    def set_motive
      @motive = Motive.find(params[:id])
---
SELECT  "motives".* FROM "motives"  WHERE "motives"."id" = ? LIMIT 1  [["id", 1]]