FixingStreet+/app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @types = Type.all

INSERT INTO "types" ("created_at", "name", "status", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-07 17:11:27.518026"], ["name", "Peaton"], ["status", "t"], ["updated_at", "2014-10-07 17:11:27.518026"]]
---
  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save

SELECT  "types".* FROM "types"  WHERE "types"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_type
      @type = Type.find(params[:id])