FixingStreet+/app/controllers/ubigeos_controller.rb

  def index
    @ubigeos = Ubigeo.all
---
SELECT "ubigeos".* FROM "ubigeos"

  def create
    @ubigeo = Ubigeo.new(ubigeo_params)

    respond_to do |format|
      if @ubigeo.save
---
INSERT INTO "ubigeos" ("code", "created_at", "level", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "03"], ["created_at", "2014-10-07 17:12:49.222682"], ["level", 3], ["name", "Ate"], ["status", "t"], ["updated_at", "2014-10-07 17:12:49.222682"]]

    def set_ubigeo
      @ubigeo = Ubigeo.find(params[:id])
---
SELECT  "ubigeos".* FROM "ubigeos"  WHERE "ubigeos"."id" = ? LIMIT 1  [["id", 1]]