FixingStreet+/app/views/incidences/_form.html.erb

SELECT "types".* FROM "types"
---
    <%= f.label :tipo %><br>
    <%= f.collection_select :type_id, Type.all, :id, :name, prompt: true %>

SELECT "motives".* FROM "motives"
---
    <%= f.label :Motivo %><br>
    <%= f.collection_select :motive_id, Motive.all, :id, :name, prompt: true %>

SELECT "ubigeos".* FROM "ubigeos"
---
    <%= f.label :distrito %><br>
    <%= f.collection_select :ubigeo_id, Ubigeo.all, :id, :name, prompt: true %>